 Create a pandas dataframe, df_iris, from this data.

print the first 3 rows
print the number of rows and columns (shape)
print the column names
print the data type of each column
print the summary statistics for each of the numeric variables

In [33]:
import pandas as pd
import seaborn as sns

# load the iris dataset
iris = sns.load_dataset('iris')

In [34]:
# assign the dataset to a DataFrame
df_iris = pd.DataFrame(iris)

In [35]:
# print the first 3 rows
print(df_iris.head(3))

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [36]:
# print the number of rows and columns (shape)
print(df_iris.shape)

(150, 5)

In [5]:
# print the column names
print(df_iris.columns)

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [7]:
# print the data type of each column
print(df_iris.dtypes)

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [8]:
# print the summary statistics for each of the numeric variables
print(df_iris.describe())

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Read the data from this google sheet (https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357) into a dataframe, df_google.

print the first 3 rows
print the number of rows and columns
print the column names
print the data type of each column
print the summary statistics for each of the numeric variables
print the unique values for each of your categorical variables

In [9]:
import pandas as pd

sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_googlesheet = pd.read_csv(csv_export_url)
df_googlesheet.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
import pandas as pd

sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

# print the first 3 rows
print(df_google.head(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

In [11]:
# print the number of rows and columns
print(df_google.shape)

(891, 12)

In [12]:
# print the column names
print(df_google.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [13]:
# print the data type of each column
print(df_google.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [14]:
# print the summary statistics for each of the numeric variables
print(df_google.describe())

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [15]:
# unique catagories are the columns
print(df_google.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

assign the first 100 rows to a new dataframe, df_excel_sample
print the number of rows of your original dataframe
print the first 5 column names
print the column names that have a data type of object
compute the range for each of the numeric variables.

In [27]:

# File paths can be local.csv files or hosted .csv files
url = "/Users/jogideon/codeup-data-science/classification-exercises/train - train.csv"

df = pd.read_csv(url)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Data Preperation

In [16]:
# Using the Iris Data: 
# Use the function defined in acquire.py to load the iris data.

from acquire import get_iris_data

# Load iris data into a pandas DataFrame
df_iris = get_iris_data()

# Display the first 5 rows of the DataFrame
df_iris.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

In [17]:
# Drop the species_id and measurement_id columns. (There is no measurement_id column)

# Drop the species_id and measurement_id columns from the DataFrame
df_iris = df_iris.drop(columns=['species_id'])

# Display the first 5 rows of the updated DataFrame
df_iris.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

In [18]:
# Rename the species_name column to just species.

# Rename the species_name column to species
df_iris = df_iris.rename(columns={'species_name': 'species'})

# Display the first 5 rows of the updated DataFrame
df_iris.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

In [19]:
# Create dummy variables of the species name and concatenate onto the iris dataframe. 
# (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

# Create dummy variables of the species column
species_dummies = pd.get_dummies(df_iris['species'], drop_first=True)

# Concatenate the dummy variables onto the original DataFrame
df_iris = pd.concat([df_iris, species_dummies], axis=1)

# Display the first 5 rows of the updated DataFrame
df_iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

In [20]:
# Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

import pandas as pd

def prep_iris(df):
    '''
    This function accepts the untransformed iris data as a pandas DataFrame and applies the following transformations:
    - Drops the species_id and measurement_id columns
    - Renames the species_name column to species
    - Creates dummy variables of the species column and concatenates them onto the original DataFrame
    '''
    # Drop the species_id and measurement_id columns from the DataFrame
    df = df.drop(columns=['species_id', 'measurement_id'])

    # Rename the species_name column to species
    df = df.rename(columns={'species_name': 'species'})

    # Create dummy variables of the species column
    species_dummies = pd.get_dummies(df['species'], drop_first=True)

    # Concatenate the dummy variables onto the original DataFrame
    df = pd.concat([df, species_dummies], axis=1)

    return df

Using the Titanic dataset

Use the function defined in acquire.py to load the Titanic data.

In [37]:
import pandas as pd
from acquire import get_titanic_data

# Load Titanic data into a pandas DataFrame
df_titanic = get_titanic_data()

# Display the first 5 rows of the DataFrame
df_titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [38]:

# Drop unnecessary columns from the DataFrame
df_titanic = df_titanic.drop(columns=['embarked', 'pclass', 'sibsp', 'parch'])

# Display the first 5 rows of the updated DataFrame
df_titanic.head()

,passenger_id,survived,sex,age,fare,class,deck,embark_town,alone
0,0,0,male,22.0,7.2500,Third,NaN,Southampton,0
1,1,1,female,38.0,71.2833,First,C,Cherbourg,0
2,2,1,female,26.0,7.9250,Third,NaN,Southampton,1
3,3,1,female,35.0,53.1000,First,C,Southampton,0
4,4,0,male,35.0,8.0500,Third,NaN,Southampton,1

In [23]:
# Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

# Encode categorical columns
df_titanic['sex'] = pd.get_dummies(df_titanic['sex'], drop_first=True)
df_titanic = pd.concat([df_titanic,pd.get_dummies(df_titanic['embark_town'], prefix='embark', drop_first=True)], axis=1)

# Drop original categorical columns that have been encoded
df_titanic = df_titanic.drop(columns=['sex', 'embark_town'])

# Display the first 5 rows of the updated DataFrame
df_titanic.head()

,passenger_id,survived,age,fare,class,deck,alone,embark_Queenstown,embark_Southampton
0,0,0,22.0,7.2500,Third,NaN,0,0,1
1,1,1,38.0,71.2833,First,C,0,0,0
2,2,1,26.0,7.9250,Third,NaN,1,0,1
3,3,1,35.0,53.1000,First,C,0,0,1
4,4,0,35.0,8.0500,Third,NaN,1,0,1

In [24]:
# Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

def prep_titanic(df):
    # Drop unnecessary columns
    df = df.drop(columns=['deck', 'embark_town', 'survived', 'class'])
    
    # Fill missing values
    df['age'] = df['age'].fillna(df['age'].median())
    df['embarked'] = df['embarked'].fillna(df['embarked'].mode()[0])
    
    # Encode categorical columns
    df['sex'] = pd.get_dummies(df['sex'], drop_first=True)
    df = pd.concat([df,pd.get_dummies(df['embarked'], prefix='embarked', drop_first=True)], axis=1)
    
    # Drop original categorical columns that have been encoded
    df = df.drop(columns=['embarked'])
    
    # Return the updated DataFrame
    return df

Using the Telco dataset

Use the function defined in acquire.py to load the Telco data.

In [7]:
import pandas as pd
from sklearn.model_selection import train_test_split
from acquire import get_telco_data

# Load Telco data into a pandas DataFrame
df_telco = get_telco_data()

# Prepare the data
df_telco = prep_telco(df_telco)
df_telco.head()

/var/folders/lt/y6xmh16d01v7kft3lkkslw4h0000gn/T/ipykernel_36915/2526049056.py:13: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead.
  df = df.replace("", pd.np.nan)

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,senior_citizen,tenure,monthly_charges,total_charges,churn,gender_Male,multiple_lines_1,multiple_lines_No phone service,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,2,1,2,0002-ORFBO,0,9,65.6,593.30,0,0,0,0,1,0,0,0,0,0,1
1,2,1,1,0003-MKNFE,0,9,59.9,542.40,0,1,1,0,0,0,0,0,0,0,1
2,1,2,1,0004-TLHLJ,0,4,73.9,280.85,1,1,0,0,0,0,1,0,0,1,0
3,1,2,1,0011-IGKFF,1,13,98.0,1237.85,1,1,0,0,0,0,1,0,0,1,0
4,2,2,1,0013-EXCHZ,1,3,83.9,267.40,1,0,0,0,0,0,1,0,0,0,1

In [8]:
# Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

df_telco = df_telco.drop(['payment_type_id', 'internet_service_type_id', 'contract_type_id', 'customer_id'], axis=1)
df_telco.head()

,senior_citizen,tenure,monthly_charges,total_charges,churn,gender_Male,multiple_lines_1,multiple_lines_No phone service,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0,9,65.6,593.30,0,0,0,0,1,0,0,0,0,0,1
1,0,9,59.9,542.40,0,1,1,0,0,0,0,0,0,0,1
2,0,4,73.9,280.85,1,1,0,0,0,0,1,0,0,1,0
3,1,13,98.0,1237.85,1,1,0,0,0,0,1,0,0,1,0
4,1,3,83.9,267.40,1,0,0,0,0,0,1,0,0,0,1

In [9]:
# Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

import pandas as pd

# Load Telco data into a pandas DataFrame
df_telco = get_telco_data()

# Drop any unnecessary, unhelpful, or duplicated columns
df_telco = df_telco.drop(['payment_type_id', 'internet_service_type_id', 'contract_type_id', 'customer_id'], axis=1)

# Encode the 'churn' column as 1 for 'Yes' and 0 for 'No'
df_telco['churn'] = df_telco['churn'].replace({'Yes': 1, 'No': 0})

# Get the categorical columns
cat_cols = ['gender', 'partner', 'dependents', 'phone_service', 'multiple_lines',
            'online_security', 'online_backup', 'device_protection', 'tech_support',
            'streaming_tv', 'streaming_movies', 'paperless_billing',
            'contract_type', 'internet_service_type', 'payment_type']

# Use get_dummies() to create dummy variables
dummy_df = pd.get_dummies(df_telco[cat_cols], drop_first=True)

# Concatenate the dummy variables onto the original DataFrame
df_telco = pd.concat([df_telco, dummy_df], axis=1)

# Drop the original categorical columns
df_telco.drop(cat_cols, axis=1, inplace=True)

# Set the 'churn' column as the target variable
target = 'churn'

In [10]:
#Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

# Prepare function
def prep_telco(df):
    # Drop duplicate rows
    df = df.drop_duplicates()

    # Replace blank values with NaN
    df = df.replace("", pd.np.nan)

    # Replace "No internet service" with "No" for relevant columns
    cols = ['online_security', 'online_backup', 'device_protection', 'tech_support', 'streaming_tv', 'streaming_movies']
    for col in cols:
        df[col] = df[col].replace("No internet service", "No")

    # Replace binary columns with 1 (Yes) and 0 (No)
    binary_cols = ['partner', 'dependents', 'phone_service', 'multiple_lines', 'online_security', 'online_backup', 'device_protection', 'tech_support', 'streaming_tv', 'streaming_movies', 'paperless_billing', 'churn']
    for col in binary_cols:
        df[col] = df[col].replace({"Yes": 1, "No": 0})

    # Convert total_charges to a numeric data type
    df['total_charges'] = pd.to_numeric(df['total_charges'], errors='coerce')
    
    # Encode the categorical columns
    cat_cols = ['gender', 'partner', 'dependents', 'phone_service', 'multiple_lines',
            'online_security', 'online_backup', 'device_protection', 'tech_support',
            'streaming_tv', 'streaming_movies', 'paperless_billing',
            'contract_type', 'internet_service_type', 'payment_type']

    dummy_df = pd.get_dummies(df[cat_cols], drop_first=True)

    df = pd.concat([df, dummy_df], axis=1)

    df.drop(cat_cols, axis=1, inplace=True)

    return df

In [29]:
# Split your data
# Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.
import pandas as pd
from sklearn.model_selection import train_test_split
def split_data(df, target):
    '''
    This function takes in a dataframe and target name and splits the data into
    train, validate, and test subsets. It returns the X_train, X_validate, X_test,
    y_train, y_validate, and y_test dataframes and series.
    '''
    # Split the data into train + validate and test sets
    train_validate, test = train_test_split(df, test_size=0.2, random_state=123, stratify=df[target])

    # Split the train + validate set into train and validate sets
    train, validate = train_test_split(train_validate, test_size=0.3, random_state=123, stratify=train_validate[target])

    # Separate the target variable from the features
    X_train = train.drop(columns=[target])
    y_train = train[target]
    X_validate = validate.drop(columns=[target])
    y_validate = validate[target]
    X_test = test.drop(columns=[target])
    y_test = test[target]

    return X_train, X_validate, X_test, y_train, y_validate, y_test

In [30]:
# Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.


from acquire import get_iris_data
from prepare import prep_iris, split_data

# Load the Iris dataset
df_iris = get_iris_data()

# Prepare the Iris dataset
df_iris = prep_iris(df_iris)

# Split the data into train, validate, and test datasets
X_train, X_validate, X_test, y_train, y_validate, y_test = split_data(df_iris, 'species')

# Print the shapes of the resulting datasets
print(f"X_train shape: {X_train.shape}")
print(f"X_validate shape: {X_validate.shape}")
print(f"X_test shape: {X_test.shape}")
print(f"y_train shape: {y_train.shape}")
print(f"y_validate shape: {y_validate.shape}")
print(f"y_test shape: {y_test.shape}")

X_train shape: (84, 6)
X_validate shape: (36, 6)
X_test shape: (30, 6)
y_train shape: (84,)
y_validate shape: (36,)
y_test shape: (30,)

In [31]:
# Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

from acquire import get_titanic_data
from prepare import prep_titanic, split_data

# Load the Titanic dataset
df_titanic = get_titanic_data()

# Prepare the Titanic dataset
df_titanic = prep_titanic(df_titanic)

# Split the data into train, validate, and test datasets
X_train, X_validate, X_test, y_train, y_validate, y_test = split_data(df_titanic, 'sex')

# Print the shapes of the resulting datasets
print(f"X_train shape: {X_train.shape}")
print(f"X_validate shape: {X_validate.shape}")
print(f"X_test shape: {X_test.shape}")
print(f"y_train shape: {y_train.shape}")
print(f"y_validate shape: {y_validate.shape}")
print(f"y_test shape: {y_test.shape}")

X_train shape: (498, 9)
X_validate shape: (214, 9)
X_test shape: (179, 9)
y_train shape: (498,)
y_validate shape: (214,)
y_test shape: (179,)

In [11]:
# Run the function on the Telco_churn dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

# Split the data into train, validate, and test sets
train_telco, test_telco = train_test_split(df_telco, test_size=0.2, random_state=123)
train_telco, validate_telco = train_test_split(train_telco, test_size=0.25, random_state=123)

# Print the shapes of the resulting dataframes
print(f'Train: {train_telco.shape}, Validate: {validate_telco.shape}, Test: {test_telco.shape}')

Train: (4225, 31), Validate: (1409, 31), Test: (1409, 31)